# MSADS 507 M4

## Importing Libraries

In [3]:
import numpy as no
import pandas as pd
import pymysql as mysql
import matplotlib.pyplot as plt 
import warnings 
warnings.filterwarnings('ignore')


userName = 'root'
userPass = 'yb%Q8!ec'

## Creating SQL DB Connection

In [5]:
conn=mysql.connect(host='localhost',port=int(3306),user=userName,passwd=userPass,db='gravity_books')

In [6]:
tableNames = pd.read_sql("""SHOW TABLES""", conn) 
tableNames

   Tables_in_gravity_books
0                  address
1           address_status
2                   author
3                     book
4              book_author
5            book_language
6                  country
7               cust_order
8                 customer
9         customer_address
10           order_history
11              order_line
12            order_status
13               publisher
14         shipping_method

## Exploratory Data Analysis

In [7]:
# 1. Period: the transaction between ** to **

#latest order date:
a = pd.read_sql_query("""

SELECT order_date 
FROM cust_order
ORDER BY order_date DESC 
LIMIT 1

""" , con = conn) 
a

           order_date
0 2023-02-13 06:37:24

In [8]:
# earliest order date:

b = pd.read_sql_query("""

SELECT order_date 
FROM cust_order 
ORDER BY order_date
LIMIT 1

""" , con = conn) 
b

           order_date
0 2020-02-14 17:22:16

In [9]:
# order counts in the first year:

c = pd.read_sql_query("""

SELECT COUNT(*)
FROM cust_order
WHERE order_date BETWEEN '2020-02-06' AND '2021-02-05'

""" , con = conn) 
c

   COUNT(*)
0      2450

In [10]:
# order counts in the second year:

d = pd.read_sql_query("""

SELECT COUNT(*)
FROM cust_order
WHERE order_date BETWEEN '2021-02-06' AND '2022-02-05'

""" , con = conn) 
d

   COUNT(*)
0      2608

In [11]:
# order counts in the last year:

d = pd.read_sql_query("""

SELECT COUNT(*)
FROM cust_order
WHERE order_date BETWEEN '2022-02-06' AND '2023-02-05'

""" , con = conn) 
d

   COUNT(*)
0      2429

In [12]:
# 2. How many orders and books are sold in total?

e = pd.read_sql_query("""

SELECT COUNT(order_id), COUNT(book_id) books_sold
FROM order_line;

""" , con = conn) 
e

   COUNT(order_id)  books_sold
0            15400       15400

In [13]:
# 3. How many customer numbers are in the data?

f = pd.read_sql_query("""

SELECT COUNT(DISTINCT(customer_id)) 
FROM cust_order;

""" , con = conn) 
f

   COUNT(DISTINCT(customer_id))
0                          1712

In [14]:
# 4. Which customer placed the most orders?

g = pd.read_sql_query("""

SELECT c.customer_id, c.first_name, c.last_name, COUNT(*) 
FROM customer c
LEFT JOIN cust_order co
ON c.customer_id = co.customer_id
GROUP BY c.customer_id
ORDER BY COUNT(DISTINCT( co.order_id)) DESC LIMIT 1;

""" , con = conn) 
g

   customer_id first_name  last_name  COUNT(*)
0          764   Giuditta  Giorgetti        20

In [15]:
# 5. What shipping method is most preferred, and what percentage of total

h = pd.read_sql_query("""

SELECT sm.method_name, COUNT(*),COUNT(*) * 100.0 / SUM(COUNT(*)) OVER() AS 'Percent of total'
FROM shipping_method sm
RIGHT JOIN cust_order co
ON sm.method_id = co.shipping_method_id
GROUP BY sm.method_name
ORDER BY COUNT(*) DESC;

""" , con = conn) 
h

     method_name  COUNT(*)  Percent of total
0       Priority      1902          25.19205
1        Express      1891          25.04636
2  International      1880          24.90066
3       Standard      1877          24.86093

In [16]:
# 6. author who published the most books:

i = pd.read_sql_query("""

SELECT a.author_id, a.author_name, COUNT(DISTINCT(b.book_id)) AS 'Books Published'
FROM author a
INNER JOIN book_author ba
ON a.author_id = ba.author_id
INNER JOIN book b
ON ba.book_id = b.book_id 
GROUP BY a.author_id
ORDER BY COUNT(DISTINCT(b.book_id)) DESC
LIMIT 1;

""" , con = conn) 
i

   author_id   author_name  Books Published
0       8222  Stephen King               70

In [17]:
# 7. best-selling author

j = pd.read_sql_query("""

SELECT a.author_id, a.author_name, COUNT(ol.order_id) AS Num_Sold 
FROM author a
INNER JOIN book_author ba
ON a.author_id = ba.author_id
INNER JOIN book b
ON ba.book_id= b.book_id
INNER JOIN order_line ol
ON b.book_id = ol.book_id
GROUP BY a.author_id
ORDER BY COUNT(ol.order_id) DESC 
LIMIT 1;

""" , con = conn) 
j

   author_id   author_name  Num_Sold
0       8222  Stephen King        97

In [18]:
# 8. best-selling book
# books sold total

k = pd.read_sql_query("""

SELECT COUNT(book_id)
FROM order_line;

""" , con = conn) 
k

   COUNT(book_id)
0           15400

In [19]:
# DISTINCT books sold in total

l = pd.read_sql_query("""

SELECT COUNT(DISTINCT(book_id))
FROM order_line;

""" , con = conn) 
l

   COUNT(DISTINCT(book_id))
0                      8311

In [20]:
# best-selling book

m = pd.read_sql_query("""

SELECT b.book_id, b.title, COUNT(*)
FROM book b
RIGHT JOIN order_line ol
ON b.book_id = ol.book_id
GROUP BY b.book_id
ORDER BY COUNT(*) DESC
LIMIT 10;

""" , con = conn) 
m

   book_id                                              title  COUNT(*)
0     7513                         Secret Identity (Lost  #2)         8
1     1013                Justine (The Alexandria Quartet #1)         8
2     3917                                  Idoru (Bridge #2)         7
3      773                                          Grizzwold         7
4     7451  The Mammoth Book of New Jules Verne Adventures...         7
5     1354                            How Green Was My Valley         6
6     2473                  Rose in Bloom (Eight Cousins  #2)         6
7     2386       Shadow & Claw (The Book of the New Sun #1-2)         6
8      965                                      Under the Net         6
9     2810                                    The Fourth Hand         6

In [21]:
# 9. Which book makes the most profit: 

n = pd.read_sql_query("""

SELECT ol.book_id, b.title, a.author_name, SUM(ol.price) 
FROM order_line ol
LEFT JOIN book b
ON ol.book_id = b.book_id
LEFT JOIN book_author ba
ON b.book_id = ba.author_id
LEFT JOIN author a
ON ba.author_id = a.author_id
GROUP BY ol.book_id 
ORDER BY SUM(ol.price) DESC 
LIMIT 1;

""" , con = conn) 
n

,book_id,title,author_name,SUM(ol.price)
0,5995,Frogs/Assemblywomen/Wealth (Loeb Classical Lib...,Mercedes Lackey,1559.18

In [19]:
# 10. The top five books with the most language versions 

o = pd.read_sql_query("""

SELECT b.title, b.book_id, bl.language_name, COUNT(*) 
FROM book b
LEFT JOIN book_language bl
ON b.language_id = bl.language_id
GROUP BY b.book_id
ORDER BY COUNT(DISTINCT(bl.language_name)) DESC 
LIMIT 5;

""" , con = conn) 
o

,title,book_id,language_name,COUNT(*)
0,The World's First Love: Mary Mother of God,1,United States English,1
1,The Illuminati,2,English,1
2,The Servant Leader,3,English,1
3,What Life Was Like in the Jewel in the Crown: ...,4,English,1
4,Cliffs Notes on Aristophanes' Lysistrata The ...,5,English,1

In [22]:
# 11. Books in different languages rank

p = pd.read_sql_query("""

SELECT bl.language_id, bl.language_name, COUNT(*), COUNT(*) * 100.0 / SUM(COUNT(*)) OVER() AS 'Percent of total'
FROM book_language bl
RIGHT JOIN book b
ON bl.language_id = b.language_id
GROUP BY b.language_id
ORDER BY COUNT(*) DESC;

""" , con = conn) 
p

    language_id          language_name  COUNT(*)  Percent of total
0             1                English      8911          80.08448
1             2  United States English      1409          12.66289
2             4                Spanish       218           1.95920
3             5        British English       214           1.92325
4             3                 French       144           1.29415
5            10                 German        99           0.88973
6            11               Japanese        46           0.41341
7             6     Multiple Languages        19           0.17076
8            14                Chinese        14           0.12582
9             7                  Greek        11           0.09886
10           16             Portuguese        10           0.08987
11            9       Canadian English         7           0.06291
12           18                Italian         5           0.04494
13            8         Middle English         3           0.02696
14           15                  Latin         3           0.02696
15           19                Russian         2           0.01797
16           23                Swedish         2           0.01797
17           12                 Arabic         1           0.00899
18           13                  Dutch         1           0.00899
19           17                Serbian         1           0.00899
20           20              Malaysian         1           0.00899
21           21               Galician         1           0.00899
22           22                  Welsh         1           0.00899
23           24              Norwegian         1           0.00899
24           25                Turkish         1           0.00899
25           26                 Gaelic         1           0.00899
26           27                  Aleut         1           0.00899

In [23]:
# 12. Which customer brings in the most profit?

q = pd.read_sql_query("""

SELECT c.customer_id, c.first_name, c.last_name, SUM(ol.price) AS Spent 
FROM customer c
INNER JOIN cust_order co
ON c.customer_id = co.customer_id
INNEr JOIN order_line ol
ON co.order_id = ol.order_id 
GROUP BY c.customer_id
ORDER BY Spent DESC
LIMIT 5;

""" , con = conn) 
q

   customer_id first_name last_name   Spent
0          559    Cthrine    Spence  405.99
1         1549       Leda    Futter  405.58
2         1503      Arlen      Plum  383.25
3         1117     Nettie  Halladey  375.91
4         1497  Friedrich   Fallows  365.01

In [24]:
# 13. The top five cities have the most orders placed by customers. 

r = pd.read_sql_query("""

SELECT ad.city, ctr.country_name, COUNT(*), COUNT(*) * 100.0 / SUM(COUNT(*)) OVER() AS 'Percent of total'
FROM address ad
INNER JOIN customer_address ca
ON ad.address_id = ca.address_id
INNER JOIN cust_order co
ON ca.customer_id = co.customer_id
INNER JOIN order_line ol
ON co.order_id = ol.order_id
INNER JOIN country ctr
ON ad.country_id = ctr.country_id
GROUP BY ad.city, ctr.country_name
ORDER BY COUNT(*) DESC 
LIMIT 5;

""" , con = conn) 
r

        city  country_name  COUNT(*)  Percent of total
0  Creighton  South Africa       156           0.49047
1     Xinhua         China       155           0.48733
2       Klau     Indonesia       155           0.48733
3  Barbacena        Brazil       152           0.47790
4     Masape     Indonesia       149           0.46847

## Adding External Data Sources

In [ ]:
d1 = pd.read_csv('data.csv')
d2 = pd.read_csv('data.csv')
d3 = pd.read_csv('data.csv')